Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཤི་ནས་མི་སྲིད་འདིར་འོངས་ཏེ། །གཟི་བརྗིད་ལྡན་ཞིང་དཔལ་ནི་འབར་གྱུར་ལ། །ཉི་མ་ལ་ནི་བརྟག་པར་མི་བཟོད་ལྟར། །དེ་ཡི་གཟི་བརྗིད་མཆོག་ཏུ་བཟང་བར་འགྱུར། །
en: “ ‘When they die there and return to human life, They will be dignified and resplendent with grandeur. Their splendor will be as sublime As the sun, which transcends scrutiny.

source: མི་གང་ལས་ཀྱི་རྣམ་སྨིན་དག་ལ་རྨོངས། །རང་གིས་བྱས་དང་དབང་ཕྱུག་སྤྲུལ་པ་དང་། །བདེ་དང་སྡུག་བསྔལ་རྒྱུ་མེད་འདོད་པའམ། །ལས་ཀྱི་འབྲས་བུ་མེད་པར་སེམས་པ་དག །
en: “Those who, confused about the ripening of karma, Claim things create themselves or emanate from God, Or that happiness and suffering have no cause, Or think that actions have no consequences,

source: ལས་རྣམས་སྨིན་ལ་དེའི་ཡིད་ལོག་ཞུགས་པས། །དེ་ནི་ལུས་དང་ངག་གི་ཉེས་པ་བྱེད། །
en: “With such wrong ideas about how karma ripens Will misbehave in physical action and speech.

source: མི་ཡི་ལུས་ནི་དེ་ཡིས་སྤངས་ནས་སུ། །ངན་སོང་དང་ནི་སྡུག་བསྔལ་ཉམས་པ་འཐོབ། །
en: When they lose their life as a human, they will end up In the lower realms to face degeneration and suffering.

source: དེ་ནས་ཤི་ནས་མི་སྲིད་འདིར་འོངས་ཏེ། །ཤེས་རབ་རྟུལ་ཞིང་བློ་མེད་དེ་གླེན་འགྱུར། །
en: “ ‘When they die there and return to human life, They will be dumb, dull-witted, and unintelligent.

source: འདྲེན་པ་རྣམས་ཀྱིས་ལས་ནི་མི་ཤེས་པས། །སངས་རྒྱས་སྟོང་གིས་དགྲོལ་བར་དེ་མི་སྤྱོད། །
en: They will not understand karma as taught by the guides, And even if a thousand buddhas try to free them, they will not act.

source: ལས་ཀྱིས་འགྲོ་བར་རབ་ཏུ་ཆུད་གཟོན་ཞེས། །ལས་རྣམས་སྨིན་ལ་མཁས་པ་དེ་ངེས་པས། །ཁྲིད་མཛད་ལས་ནི་ཁ་དྲང་དེ་མི་ནུས། །
en: “ ‘Those who are knowledgeable about the ripening of karma, Certain that karma is what annihilates beings, Cannot be guided by anyone except the Leader.

source: དེ་ཡིས་ལེགས་པའི་ལས་དེ་བྱས་པས་ན། །འདི་ནས་ཤི་ནས་མཐོ་རིས་རབ་ཏུ་དགའ། །
en: Creating positive karma, after they die “ ‘They will live in pleasure in the higher realms.

source: ལྷ་ཡི་འཇིག་རྟེན་གནས་ཏེ་དེ་ནས་ཤི། །མི་ཡི་འཇིག་རྟེན་གནས་ཏེ་ལེགས་པར་བཀུར། །མཁས་པ་དེ་ནི་རྟག་ཏུ་ལེགས་བཀུར་ཅིང་། །ནམས་ཀྱང་ཉོན་མོངས་དག་ཏུ་མི་འགྲོའོ། །
en: After dwelling in the god realms, when they die there They will live in the human realm again and be worshiped, Forever honored as those who are wise. “ ‘They will never become involved with afflictions,

source: དེ་ཡི་ལྟ་བ་སྡིག་དང་མི་ལྡན་ཏེ། །རྟག་ཏུ་དམ་པའི་ཆོས་ལ་ངེས་པར་སྤྱོད། །
en: They will never have a negative perspective, And they will always embrace the practice of the sublime Dharma.

source: དེ་ནི་འགྲོ་བའི་ལས་དང་སྡིག་པ་དང་། །གནོད་པ་དང་ནི་ཉོན་མོངས་དེ་དག་བསྟན། །
en: They will teach about beings’ karma—what is bad, “ ‘What is harmful, and what afflictions are.

source: བཟློག་པས་དགེ་བ་དང་ནི་བསྟན་པ་སྟེ། །
en: They will teach how to turn others around to virtue.

source: རྣམ་པར་བྱང་དང་མཐོ་རིས་ལམ་ཡང་བསྟན། །དེ་ནི་སྡུག་བསྔལ་ཀུན་ལ་རབ་འཇུག་པའི། །སྐྱེ་བའི་རྒྱུ་ལས་ཐམས་ཅད་རབ་ཏུ་འབྱུང་། །
en: They will teach the path to purification and the higher realms, And how to escape all the causes of birth, Which lead to involvement in so much suffering.

source: གང་ཞིག་འདི་ལས་ངེས་འབྱུང་མི་ཤེས་པ། །གལ་ཏེ་དེ་ཡི་གནོད་མེད་ཞི་འདོད་ན། །
en: If they do not know how to renounce these, And yet seek to quell them so they do no harm,

source: ལས་ཀྱི་འཇིག་རྟེན་ཕ་རོལ་ཅི་མི་འགྲོ། །
en: How can they avoid going to another karmic realm,

source: འཇིག་རྟེན་ཕ་རོལ་ནས་ཀྱང་ཅིས་མ་འོངས། །
en: “ ‘Or returning from that realm again?

source: སངས་རྒྱས་བསྟན་པ་འཕོ་མེད་ཤེས་པར་གྱིས། །བྱས་པའི་འབྲས་བུའང་ཆུད་ཟར་མི་འགྱུར་ཞིང་། །
en: Understand that the Buddha’s teachings are immutable, And that the consequences of actions do not just disappear.

source: བྱེད་པ་པོ་དང་ལས་ཀྱང་གང་ཡང་མེད། །
en: There is no doer or deed whatsoever;

source: འབྲས་བུ་སྤྱོད་པ་གང་ཡང་འཐོབ་མེད་དེ། །
en: “ ‘No result to be experienced is attained.

source: རྒྱུ་ལ་བརྟེན་ནས་ཆོས་རྣམས་རབ་ཏུ་འབྱུང་། །
en: Things come about because of causes—

source: མེད་ལ་འཛིན་པས་སྡུག་བསྔལ་རབ་ཏུ་འཇུག །
en: If you grasp at absence you are setting yourself up to suffer.

source: རྒྱལ་བ་གང་དག་འདས་དུས་ཡོངས་འདས་པས། །ཐམས་ཅད་ཆུ་ཟླ་ལྟ་བུར་གཟིགས་པས་ན། །ཆོས་རྣམས་ངོ་བོ་ཉིད་ནི་དེ་འདྲར་ལྟོས། །
en: “ ‘The victors have transcended the past And see everything like a moon’s reflection— You should regard phenomena in essence like that.

source: ཇི་ལྟར་སྨིག་རྒྱུའི་ངོ་བོ་ཉིད་མེད་ལྟར། །དངོས་དང་དངོས་མེད་བྲལ་བ་ཅི་ཡང་མེད། །
en: Just like a mirage is not essentially there, “ ‘There is nothing whatsoever, whether real or unreal.

source: ཇི་ལྟར་རྨི་ལམ་དུ་ནི་དངོས་མེད་དང་། །ཇི་ལྟར་ཆུ་ནང་སྤྲིན་གྱི་དངོས་མེད་ལྟར། །དེ་ལྟར་ཆོས་རྣམས་དག་གི་ངོ་བོ་མེད། །
en: Just like the contents of a dream are unreal, Or like the reflections of clouds in water are unreal, So too phenomena are insubstantial.

source: ནམ་མཁའི་བར་ན་སྐར་མ་འདུག་པ་ལྟར། །དངོས་པོའི་ངོ་བོ་གཞན་དངོས་འདི་དག་གསོག །
en: “ ‘Like stars in the sky above, Entities are devoid of some other concrete essence,

source: ཇི་ལྟར་མི་དག་མྱོས་པའི་རྨི་ལམ་ན། །དགའ་བར་ཚོར་བ་སད་ནས་དེ་མེད་ཅིང་། །རྨི་ལམ་རྨིས་པ་སྙིང་པོ་མེད་པ་སྟེ། །
en: Just like someone in the intoxication of a dream May feel pleasure, which is not there after waking. “ ‘The whole of what was dreamed was insubstantial,

source: མཚན་མོ་སད་པའི་མི་ནི་རྗེས་དྲན་དང་། །རྨི་ལམ་རྨིས་པའི་མི་ཡིས་མཐོང་བ་ལྟར། །དེ་བཞིན་དངོས་པོ་དག་དང་ངོ་བོ་མེད། །
en: And yet is recalled by the person who wakes up in the night, And seen by the person in the dream. So too are entities insubstantial.

source: ཇི་ལྟར་ཤིན་ཏུ་ཁྲོས་པར་རྨིས་པའི་མི། །རྨི་ལམ་དག་ན་ཁྲོ་བ་གང་ཡང་མེད། །
en: “ ‘If someone is enraged in a dream, Being a dream, there is no real anger,

source: མཁས་པ་སད་ནས་གནོད་སེམས་མ་མཐོང་ལྟར། །དེ་བཞིན་དངོས་པོ་ངོ་བོ་ཉིད་ཀྱིས་གསོག །
en: And when the wise awaken, they sees no malice. So too are entities devoid of substance.

source: ཇི་ལྟར་རྨི་ལམ་དག་ན་ཆང་འཐུང་མི། །དེ་ནི་ཆང་འཐུངས་པས་ན་མྱོས་པར་ཤེས། །ཆང་དང་མྱོས་པའི་དངོས་ཉིད་མེད་པ་ལྟར། །དེ་བཞིན་ཆོས་རྣམས་དག་གི་དངོས་པོ་མེད། །
en: “ ‘Like those who drink wine in a dream Are aware they have become drunk from the wine, And yet there is no real wine or intoxication, So too are things unreal.

source: ཇི་ལྟར་མི་དག་གི་ནི་རྨི་ལམ་ན། །བུད་མེད་རྒྱན་སྡུག་དག་གི་བཞིན་མཐོང་ནས། །
en: “ ‘It is just like a man who in a dream sees the face Of a woman who is lovely and adorned.

source: རྨི་ལམ་རྨིས་ཚེ་འདོད་ཆགས་སྐྱེད་པ་དག །སད་ནས་བུད་མེད་བཞིན་ནི་མ་མཐོང་སྟེ། །
en: He desires her while in the dream state, Yet after waking no longer sees her face.

source: རྨི་ལམ་དེར་ནི་བུད་མེད་མེད་པ་དང་། །དེ་བཞིན་འདོད་ཆགས་བུད་མེད་དེ་བཞིན་དགའ། །
en: “ ‘The woman in the dream is not there— Likewise with desire, women, and pleasures.

source: སད་ནས་འདོད་ཆགས་བུད་མེད་དེ་དགའ་དག །མ་མཐོང་བ་ལྟར་ཆོས་དངོས་དེ་འདྲའོ། །
en: After waking, desire, women, and pleasures Are nowhere to be seen—so too with substantial things.

source: མི་གང་མི་མཁས་རྣམ་པར་མི་ཤེས་པ། །གང་གིས་འགྲོ་བའི་གནོད་པ་མི་ཤེས་ཏེ། །
en: “ ‘Those who are unwise and unaware Do not understand what is harmful to beings.

source: འགྲོ་བའི་གནོད་པ་སྐྱེས་པ་དེ་འདྲ་ཞིང་། །མཁས་པ་ཆོས་ལ་འདོད་ཆགས་མི་སྐྱེད་དོ། །
en: Those who are wise regarding what is harmful to beings Do not have desire for things.

source: དེ་ལྟར་གཞོན་ནུ་མཁས་པའི་རང་བཞིན་ནི། །
en: “ ‘This, O Prince, is the nature of learnedness.

source: རྟག་ཏུ་ཆོས་རྣམས་རྨི་ལམ་ལྟ་བུར་རྟོག །
en: Always understand that things are like in a dream;

source: ནད་འགོ་གནོད་པ་རྣམས་ལས་ཐར་བ་ལྟར། །དེ་བཞིན་གཞན་དག་ལ་ཡང་རབ་ཏུ་ཤོད། །
en: Like healing from disease or being hurt, So too can all things be explained.’

source: མཽད་གལ་གྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་གཞོན་ནུ་ཞི་བའི་བློ་གྲོས་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time Prince Śāntamati was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོ་གཞོན་ནུ་ཞི་བའི་བློ་གྲོས་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days Prince Śāntamati was me.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་ངའི་ཤེས་པ་འདོད་པ་དང་། སེམས་ཅན་རྣམས་སྡུག་བསྔལ་ལས་ཐར་བར་འདོད་པས་ད་ལྟར་བྱུང་བའི་ཤེས་པ་ལ་རྣལ་འབྱོར་དུ་བྱའོ། །
en: Therefore, Maudgalyāyana, those who seek my knowledge, who seek to liberate sentient beings from suffering, should practice to gain knowledge of the present.

source: མཽད་གལ་གྱི་བུ་ང་ད་ལྟར་བྱུང་བ་ཤེས་པ་ལ་མངོན་པར་བརྩོན་པ་དེའི་འཇིགས་པ་མེད་པས་ལུས་དང་སྲོག་ལ་མི་ལྟ་བར་གྱུར་ཏེ། ལུས་དང་སྲོག་ལ་མ་བལྟས་པའི་དགེ་བའི་རྩ་བ་བསྐྱེད་དོ། །
en: “Maudgalyāyana, I persevered in understanding the present, fearlessly risking life and limb, creating the roots of virtue that come from risking life and limb.

source: ད་ལྟར་བྱུང་བའི་ཤེས་པ་མངོན་པར་གྲུབ་པའི་རྒྱུ་གང་ཡིན་རྐྱེན་གང་ཡིན་ཞེ་ན།
en: What provided the causes and conditions for accomplishing knowledge of the present, you may ask?

source: ངས་དགེ་སྦྱོང་དང་བྲམ་ཟེ་མཁས་པ་དག་ལ་བསྙེན་བཀུར་བྱས་ཤིང་ཡོངས་སུ་ཞུས་པ་ཡིན་ནོ། །
en: It was the way I served and asked questions to the learned mendicants and brahmins.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པ་ན། མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཉིད་རིན་པོ་ཆེའི་མེ་ཏོག་བརྩེགས་པ་ཞེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གྱུར་ཅིང་། འཛམ་བུའི་གླིང་འདི་གསེར་འོད་ཅེས་བྱ་བའི་གླིང་ཆེན་པོར་གྱུར་ཏེ
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, an amount of eons in the distant past that is even beyond countless, this very world, Endurance, was a world system known as Layers of Jewel Flowers. This very continent, Jambūdvīpa, was a great continent known as Golden Light.

source: ཞེང་དུ་དཔག་ཚད་དྲུག་ཁྲི་ཡོད་ཅིང་། ཆུར་ཡང་དཔག་ཚད་དྲུག་ཁྲི་ཡོད་ལ་གྲུ་བཞི་པ་མཛེས་པར་སྤྲུལ་པ། ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་སྐལ་བ་མཉམ་པ་སྟེ།
en: It was beautifully formed in a square shape, sixty thousand leagues wide and sixty thousand leagues long, perfectly proportioned and symmetrical.

source: དཔེར་ན་གླིང་ཆེན་པོ་བྱང་གི་སྒྲ་མི་སྙན་འདི་ཉིད་ཀྱི་ཡོངས་སུ་སྤྱོད་པ་དང་འདྲའོ། །
en: It was as bountiful, for instance, as the current northern continent, Kuru.

source: གླིང་ཆེན་པོ་གསེར་འོད་ཅེས་བྱ་བ་དེར་རྒྱལ་པོ་ཆད་པ་ཐོག་ཏུ་ཕེབས་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: The great continent Golden Light had a king named Expert Annihilation.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་ཞེས་བྱ་བ་ཆོས་ཐམས་ཅད་ཀྱི་རྒྱུ་ལ་མཁས་པ། ཆོས་ཐམས་ཅད་ཀྱི་རྐྱེན་ལ་མཁས་པ་ཞིག་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: At the same time there appeared in the world a thus-gone one named Vimalanetra who was learned regarding the causes and conditions of all phenomena.

source: དེ་ནས་དེའི་ཚེ་རྒྱལ་པོ་ཆད་པ་ཐོག་ཏུ་ཕེབས་པ་དེའི་དྲུང་དུ་གཞན་མུ་སྟེགས་སྤྱོད་པ་ཀུན་ཏུ་རྒྱུ་མང་པོ་དག་ཅིག་འདུས་ཏེ་འདུག་ནས། བར་དེར་ད་ལྟར་བྱུང་བའི་ཤེས་པ་མངོན་པར་གྲུབ་པའི་རྒྱུ་ནི་གང་། རྐྱེན་ནི་གང་ཞེས་གཏམ་གྱི་ཚུལ་འདི་ཉིད་ཀུན་དུ་སྨྲ་བར་གྱུར་ཏོ། །
en: Once, King Expert Annihilation had gathered in his court a number of extremist parivrājaka practitioners, who were engaged there in a discussion regarding what the causes and conditions for accomplishing knowledge of the present were.

source: དེ་ནས་གཞན་མུ་སྟེགས་སྤྱོད་པ་ཀུན་ཏུ་རྒྱུ་བ་དེ་དག་རྒྱལ་པོ་ཆད་པ་ཐོག་ཏུ་ཕེབས་པ་ག་ལ་བ་དེར་སོང་ནས། རྒྱལ་པོ་ཆད་པ་ཐོག་ཏུ་ཕེབས་པ་ལ་ཆེད་དུ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: At some point the extremist parivrājaka practitioners went before King Expert Annihilation and addressed him, saying,

source: རྒྱལ་པོ་ཆེན་པོ་རྒྱལ་བར་སྤྱོན་ཅིག །
en: ‘May you be victorious, O Great King.

source: བདག་ཅག་གིས་གསོལ་བ་རྒྱལ་པོ་ཆེན་པོ་ལ་འདེབས་པས་གལ་ཏེ་སྐབས་ཕྱེ་ན་གསོལ་ལོ། །
en: If Your Royal Highness will permit us, we have something to ask you.’

source: རྒྱལ་པོ་ཆད་པ་ཐོག་ཏུ་ཕེབས་པས་མུ་སྟེགས་པ་གཞན་སྤྱོད་པ་ཀུན་ཏུ་རྒྱུ་བ་པ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “King Expert Annihilation replied to the extremist parivrājaka practitioners,

source: ཚེ་དང་ལྡན་པ་དག་ཐེ་ཚོམ་གང་དང་གང་ཡོད་པ་དག་དྲིས་ཤིག །
en: ‘Venerable ones, please ask whatever it is you may have doubts about.

source: གལ་ཏེ་ལུང་བསྟན་པར་ནུས་ན་ལུང་བསྟན་པར་བྱའོ། །
en: If I am capable of giving an answer, I will.

source: གལ་ཏེ་མི་ནུས་ན་ཐབས་གང་གིས་ཚེ་དང་ལྡན་པ་དག་གི་དོན་འདི་ཤེས་པར་བྱ་བ་བཤད་དོ། །
en: If I am not able, I will tell you the means by which you venerable men might come to understand the matter.’

source: དེ་དག་གིས་སྨྲས་པ།
en: “They proceeded:

source: ཞལ་བཟང་ད་ལྟར་བྱུང་བའི་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བའི་རྒྱུ་ནི་གང་རྐྱེན་ནི་གང་།
en: ‘Your Majesty, what are the causes and conditions for actualizing knowledge of the present?’

source: དེས་སྨྲས་པ། ངས་དོན་འདི་ལུང་བསྟན་པར་མི་ནུས་ཏེ
en: “The king replied, ‘This is something I cannot answer.

source: འོན་ཀྱང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དྲི་མེད་སྤྱན་དེ་ང་དང་ཉེ་བ་མེ་ཏོག་འཛིན་པའི་སྐྱེད་མོས་ཚལ་འདི་ཉིད་ན་བཞུགས་ཏེ།
en: However the thus-gone, worthy, perfect buddha Vimalanetra is now staying nearby in the Park of Flowers.

source: དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་དེས་མི་མཁྱེན་པའམ། མ་གཟིགས་པའམ། ཐུགས་སུ་མ་ཆུད་པ་ཅི་ཡང་མེད་དེ།
en: There is nothing that the thus-gone Vimalanetra does not know, does not perceive, and does not realize.

source: དེ་ལ་འདི་ཞུས་དང་ལུང་སྟོན་པར་འགྱུར་བས་དེ་བཞིན་དུ་གཟུང་བར་བྱ་སྟེ།
en: Ask him, and take heed of his answer.’

source: ཚེ་དང་ལྡན་པ་དག་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་དེ་ག་ལ་བ་དེར་འདོང་།
en: “The venerable men went to see the thus-gone Vimalanetra.

source: དེ་ནས་རྒྱལ་པོ་ཆད་པ་ཐོག་ཏུ་ཕེབས་པ་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། དེ་བཞིན་གཤེགས་པ་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: King Expert Annihilation went as well, and bowed his head at the Blessed One’s feet and then sat off to one side.

source: གཞན་མུ་སྟེགས་སྤྱོད་པ་ཀུན་ཏུ་རྒྱུ་བ་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་དང་ལྷན་ཅིག་མངོན་སུམ་དུ་ཡང་དག་པར་དགའ་བ་དང་། ཡང་དག་པར་ཆགས་པར་འགྱུར་བའི་གཏམ་རྣམ་པ་སྣ་ཚོགས་དག་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: The extremist parivrājaka practitioners exchanged all sorts of pleasantries and humorous remarks with the thus-gone Vimalanetra and then sat off to one side as well.

source: ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་གཞན་མུ་སྟེགས་སྤྱོད་པ་ཀུན་ཏུ་རྒྱུ་བ་པ་དེ་དག་གིས། དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་དེ་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: From their place off to the side, the extremist parivrājaka practitioners presented their questions to the thus-gone Vimalanetra in a song:

source: དགེ་བའི་སུག་ལས་ཅི་བགྱིས་བདེ་བ་འབྱུང་། །
en: “ ‘What deeds lead to happiness?

source: ད་ལྟར་བྱུང་བའི་ཤེས་ཚུལ་རབ་ཏུ་འཚལ། །
en: Please—what is the way to know the present?

source: གང་གིས་ཡེ་ཤེས་མཆོག་ཏུ་འགྲུབ་པ་དག །
en: What leads to attaining supreme wisdom?

source: གཞན་མི་གསུང་བ་དེ་དག་བདག་ལ་ཤོད། །
en: Please answer these; no need to say more.’

source: ཉོན་མོངས་བཅོམ་པས་རྒྱལ་བ་ཐུགས་དག་སྟེ། །ཐོགས་མེད་མཁྱེན་ཅིང་ཀུན་ཏུ་སྤྱན་མངའ་བ། །
en: “Having vanquished the afflictions, the Victor knew Minds unimpededly and possessed all-seeing vision.

source: ཐོགས་མེད་མཁྱེན་པས་དེ་བསམ་ཐུགས་ཆུད་ནས། །འདྲེན་པ་དྲི་མེད་སྤྱན་གྱིས་ལུང་བསྟན་པ། །
en: So, realizing their thoughts with his unhindered wisdom, The guide Vimalanetra explained:

source: བྱམས་པའི་མིག་གིས་འགྲོ་བ་འདི་ལ་བལྟ། །
en: “ ‘Look at beings with loving eyes;

source: སྡུག་བསྔལ་རྒྱུད་དག་ལ་ནི་སྙིང་རྗེ་བསྐྱེད། །
en: Feel compassion for them with the pain in their hearts,

source: བྱམས་པ་འདི་ལ་འགྲོ་བ་རབ་ཏུ་བཀོད། །
en: Then help others to have such loving kindness.

source: ཉོན་མོངས་དག་གི་ཁམས་ལ་བཏང་སྙོམས་ཡིན། །
en: Have equanimity toward the constituents of the afflictions.

source: དེ་ཡིས་ལེགས་པའི་ལས་དེ་བྱས་པས་ན། །རྒྱུ་དེ་ཀུན་ཏུ་ཤེས་ཤིང་ཤེས་པ་འཆར། །
en: “ ‘If you carry out such excellent deeds, You will understand causes; knowledge will dawn.’

source: ལེགས་པར་བཤད་པའི་ཚུལ་འདི་ཐོས་ནས་སུ། །བྱང་ཆུབ་ལ་ནི་གཞལ་མེད་འདུན་པ་སྐྱེས། །
en: Upon hearing such a fine explanation, They felt a boundless desire to awaken.

source: གང་གིས་འགྲོ་བ་ལྷར་བཅས་རབ་གྲོལ་བའི། །ད་ལྟར་བྱུང་བའི་ཤེས་པ་འཆར་བ་འཐོབ། །
en: “ ‘The one who liberates beings, including gods, Achieves the unfolding of knowledge of the present.

source: ཆགས་པ་མེད་པའི་ཤེས་དང་ང་ལྡན་པ། །སྡུག་བསྔལ་གནོད་པའི་ཆོས་ལས་སེམས་ཅན་བཀྲོལ། །
en: I who have knowledge without attachment Have freed beings from the phenomena of harm and suffering.

source: དེ་ཡིས་ལེགས་པའི་ལས་དེ་བྱས་པས་ན། །ད་ལྟར་བྱུང་ཤེས་ཚུལ་འདི་རབ་ཏུ་ཤེས།
en: “ ‘If you carry out such excellent deeds, You will understand how to know the present.

source: གང་གིས་འགྲོ་བའི་བསམ་པ་རབ་ཤེས་པ། །དེ་ལྟར་རྒྱལ་བ་དབང་ཐུལ་ལམ་ཡང་མཁྱེན། །
en: The one who knows the minds of beings Also understands the Victor’s path to tame the senses.’

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམས་དུ་སེམས།
en: “What do you think, Maudgalyāyana?

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཆད་པ་ཐོག་ཏུ་ཕེབས་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: Maudgalyāyana, in case you may think that at that time King Expert Annihilation was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཆད་པ་ཐོག་ཏུ་ཕེབས་པར་གྱུར་ཏོ། །
en: In those days King Expert Annihilation was me.

source: དགེ་བའི་རྩ་བ་དེས་ང་ད་ལྟར་བྱུང་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་བརྙེས་ཏེ།
en: Due to those roots of virtue I gained knowledge of the origin as related to knowledge of the present.

source: མཽད་གལ་གྱི་བུད་ལྟར་བྱུང་བ་ཤེས་པ་དེའི་ད་ལྟར་བྱུང་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཟད་པའི་ཆོས་ཉིད་དང་། འགྱུར་བའི་ཆོས་ཉིད་དུ་ཤིན་ཏུ་ཡོངས་སུ་ཞུས། ཤིན་ཏུ་ཡོངས་སུ་ཤེས། ཤིན་ཏུ་མངོན་སུམ་དུ་བྱས་སོ། །
en: Maudgalyāyana, I inquired about, came to understand well, and eventually actualized the exhaustible and changing nature of that knowledge of the present—the knowledge of the origin as related to knowledge of the present.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་ཅིང་གྲངས་མེད་པའི་ཡང་གྲངས་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་དམ་འཆའ་བར་མི་མཛད་པ་ཞེས་བྱ་བ་ནས། རྒྱ་ཆེར་སྦྱར་ཏེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: “Long ago in the limitless, immeasurable cycle of existence, Maudgalyāyana, long before even the distant past there appeared in the world a thus-gone one named One Who Makes No Promises; he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: དེའི་ཚེ་བྲམ་ཟེ་ཤིན་ཏུ་བརྟགས་སྤྱོད་ཅེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ཞིག་བྱུང་སྟེ།
en: At that time there was a brahmin named Utterly Scrutinized Conduct, who was like a great sal tree.

source: དེ་བྱ་བ་གང་དང་གང་རྩོམ་པ་དེ་ཉིད་ཤིན་ཏུ་བརྟགས་ནས་བྱེད་དེ།
en: Whatever endeavor he set himself to, he carried it out only after much scrutiny.

source: སེམས་ཅན་ལ་ཕན་པའི་ཡིད་དང་། སེམས་ཅན་ལ་ཕན་པའི་སེམས་དང་ལྡན་པ་དེ་མཚན་མོ་ཐོ་རངས་ཀྱི་གཉིད་སངས་མ་ཐག་ཏུ་བར་སྣང་ལས་ཀུན་འབྱུང་གི་ཆོས་གང་ཡིན་པ་དེ་ཐམས་ཅད་ནི་འགོག་པའོ་ཞེས་སྒྲ་ཐོས་སོ། །
en: He was also highly altruistic. One night he woke up in such an altruistic mind-set as dawn was breaking, and as soon as he did so, he heard a voice in the sky saying, ‘Anything that originates also ceases.’

source: དེ་མཚན་མོ་དེ་འདས་ནས་གཉིད་སངས་ཏེ་ལངས་ནས་དེ་ཁྱིམ་ལ་མི་དགའ་ཞིང་ཁྲུས་མི་བྱེད་དེ།
en: When morning came and he roused himself and got out of bed, he felt distaste for his house.

source: ལུས་མི་སྐུད། །ཟས་མི་ཟ།
en: He did not bathe or apply lotions.

source: རྩེད་མོ་མི་བྱེད་དགའ་བར་མི་བྱེད་ཅིང་ཡོངས་སུ་མི་སྤྱོད་དེ། གཞན་དུ་ན་ཤིན་ཏུ་ཡིད་མི་དགའ་སྟེ།
en: He did not feel like eating breakfast, playing games, amusing himself, or enjoying anything.

source: སེམས་ཁོང་དུ་ཆུད་ཅིང་འདུག་གོ། །
en: He just stayed by himself, unhappy and lost in thought.

source: དེའི་མ་དང་ཕ་དང་མཛའ་བཤེས་དང་། ཉེ་དུ་དང་། སྣག་གི་གཉེན་མཚམས་རྣམས་འདུས་ནས་འདི་སྐད་ཅེས་དྲིས་སོ། །
en: Eventually his parents, friends, family members, and relatives gathered around him and said,

source: གཞོན་ནུ་ཁྱོད་ཅི་གང་གིས་ཡིད་མི་དགའ་བར་བྱས་ཤིང་ཕྱིར་ཕྱོགས་ལ་སེམས་ཁོང་དུ་ཆུད།
en: ‘Child, what is making you so unhappy, downcast, and preoccupied?’

source: དེས་མ་དང་ཕ་དང་། མཛའ་བཤེས་དང་། ཉེ་དུ་དང་། སྣག་གི་གཉེན་མཚམས་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “He replied to his parents, friends, family members, and relatives, ‘

source: ཡབ་དང་ཡུམ་བདག་དེ་རིང་མཚན་མོའི་ཐོ་རངས་གཉིད་སངས་པ་དང་། བར་སྣང་ལས་ཀུན་འབྱུང་གི་ཆོས་གང་ཡིན་པ་དེ་ཐམས་ཅད་ནི་འགོག་པའི་ཆོས་ཅན་ནོ་ཞེས་སྒྲ་ཐོས་ཏེ།
en: Father, Mother, this morning I awoke at the break of dawn, and heard a voice in the sky saying that it is the nature of everything that originates to come to an end.

source: བདག་སྒྲ་དེ་ཐོས་ནས་མི་དགའ་བ་སྐྱེས་ཏེ། འདུས་བྱས་ངན་པ་འཇིག་པའི་ཆོས་ཅན་གང་ལ་བདག་དགའ་བ་སྐྱེ་བ་བྲལ་བར་གྱུར་ཏེ།
en: Hearing those words made me upset, as I no longer can enjoy anything that is conditioned, inferior, and transitory.

source: ཡབ་བདག་ནི་གང་མི་འགོག་པའི་ཆོས་དེ་ཚོལ་ལོ། །
en: Father, find me something that will not end.’

source: དེ་ལ་མ་དང་ཕ་དེ་དག་གིས་སྨྲས་པ།
en: “His parents retorted,

source: ཅི་འཁྲུལ་ཏམ། ཅི་སྐྲག་གམ། ཅི་དངངས་སམ། ཅི་གནོད་སྦྱིན་ནམ། འབྱུང་པོ་ཁ་ཅིག་གིས་མ་གཙེས་སམ།
en: ‘Are you confused? Afraid? Frightened? Have you been harmed by a demon or a ghost?

source: གཞོན་ནུ་མི་འགོག་པའི་ཆོས་ནི་གང་ཡང་མེད་དེ
en: Son, there is nothing that does not come to an end.

source: གཞོན་ནུ་འདི་ལྟ་སྟེ་དཔེར་ན། ནམ་མཁའ་ལ་སྒྲིབ་པའམ། གཉེན་པོ་མེད་དོ། །
en: Think, for example, son, of how there is nothing that can block or overcome space.

source: གཞོན་ནུ་དེ་བཞིན་དུ་མི་འགོག་པའི་ཆོས་དེ་ནི་གང་ཡང་མེད་དོ། །
en: Just like that, son, there is nothing that does not come to an end.’

source: དེས་ཕ་མ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “The boy told his parents,

source: ཡབ་ཡུམ་མི་སྐྱེ་ན་འགུམ་པ་མ་མཆིས་ཏེ།
en: ‘Father, Mother, if something is not born, it will not die.

source: གང་སྐྱེ་བ་དེ་འགུམ་ལགས་སོ། །
en: What is born will die.

source: གང་མི་སྐྱེ་བ་ནི་དེའི་འགུམ་པ་མ་མཆིས་ཏེ།
en: Something that is not born will not die.

source: གང་གི་བུ་མཆིས་ན་དེའི་བུ་འགུམ་ལ། གང་ལ་བུ་མ་མཆིས་ན་དེའི་བུ་མི་འགུམ་པར་གདའ་ལགས་སོ། །
en: Whoever has a child, has a child that is bound to die, and yet for those who have no child, there is no child that will die.

source: དེའི་བུ་དག་ལས་བུ་སྐྱེས་ན་བུ་དང་ལྡན་པའི་བུ་འགུམ་པར་གདའ་ལགས་ཏེ།
en: Moreover, if one’s child also has a child, that child is also bound to die.

source: དེ་ལྟ་ལགས་པས་བུ་སྐྱེ་བ་མཆིས་ན་འགུམ་པ་ཡང་མཆིས་སོ། །
en: Therefore, if a child is born it must die.

source: བུ་སྐྱེ་བ་མ་མཆིས་ན་བུ་འགུམ་པར་ཡང་མི་འགྱུར་ལགས་ཏེ།
en: If a child is not born, it will not die.

source: དེ་ལྟར་ཉེ་བར་ལེན་པ་ཐམས་ཅད་ལ་ཡོངས་སུ་འཛིན་ཏེ།
en: Everyone who has appropriated, has clinging;

source: དེ་ལྟ་བས་ན་གང་ཉེ་བར་མི་ལེན་པ་དེ་དག་ལ་ནི་སྡུག་བསྔལ་མ་མཆིས་སོ། །
en: therefore those who do not appropriate will not suffer.

source: དེ་འདི་སྙམ་དུ་གྱུར་ཏེ་ཐབས་ཤིག་ཡོད་དེ། ཐབས་གང་གིས་ཡོངས་སུ་འཛིན་པའི་ཉེས་པ་མི་བསྐྱེད་པར་བྱའོ་སྙམ་མོ། །
en: Reflecting on this, I think there must be a course of action, a method by which the blemish of clinging will not come about.

source: དེ་ཡང་འདི་སྙམ་དུ་གྱུར་ཏེ། མངོན་པར་ཞེན་པ་ནི་ཡོངས་སུ་འཛིན་པའི་ཉེས་པ་སྟེ།
en: I conclude that the blemish of clinging consists of grasping.

source: མངོན་པར་ཞེན་པ་མེད་པ་ལ་ནི་ཡོངས་སུ་འཛིན་པའི་ཉེས་པ་མེད་པས།
en: When grasping is absent, there is no blemish of clinging.

source: གང་བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བར་བྱ་ཞིང་དེ་དག་ལ་མངོན་པར་ཞེན་པར་ནི་མི་བྱའོ་སྙམ་མོ། །
en: So what can I do to take care of all sentient beings and prevent them from grasping?

source: དེ་ཡང་འདི་སྙམ་དུ་གྱུར་ཏེ། སེམས་ཅན་འདི་དག་ནི་ཡོངས་སུ་འཛིན་པའི་ཉེས་པ་མི་ཤེས་ལ་དེ་ཉེས་པ་དེ་དག་སྤོང་བར་མི་བྱེད་དེ།
en: I conclude that sentient beings cannot stop the blemish of clinging because they are not aware of it.

source: ཉེས་པ་དེ་དག་མ་སྤངས་པས་ཡོངས་སུ་འཛིན་པའི་ཉེས་པས་གོས་ཏེ་བདག་གིས་འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བར་བྱ་ཞིང་སེམས་ཅན་དེ་དག་ཐམས་ཅད་བདག་གིས་བསླབ་པར་བྱ།
en: Thus they are marred by the blemish of clinging because they do not prevent it. I will take all sentient beings under my care and train them.

source: ཡོངས་སུ་འཛིན་པའི་ཉེས་པ་ཡང་ཁོང་དུ་ཆུད་པར་བྱའོ་སྙམ་མོ། །
en: Moreover, I will fully comprehend the blemish of clinging.

source: ཡོངས་སུ་འཛིན་པ་མེད་པ་ལ་ནི་བྱང་ཆུབ་མེད་དེ་སེམས་ཅན་དེ་དག་ལ་སྙིང་རྗེ་ཆེན་པོ་བསྐྱེད་ནས།
en: Without clinging, and without awakening, I will develop compassion for these sentient beings.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པ་མེད་པའི་ཚུལ་གྱིས་བཟུང་སྟེ། ཡོངས་སུ་འཛིན་པའི་ཉེས་པ་ཡང་མི་བསྐྱེད་དོ་སྙམ་མོ། །
en: I will care for beings without clinging, and I will stop producing the blemish of clinging.’ “What do you think, Maudgalyāyana?
